s, n = map(int, input().split())
n = list(map(int, str(n)))

arr = [
    [[0, 1, 0], [1, 0, 1], [0, 0, 0], [1, 0, 1], [0, 1, 0]],
    [[0, 0, 0], [0, 0, 1], [0, 0, 0], [0, 0, 1], [0, 0, 0]],
    [[0, 1, 0], [0, 0, 1], [0, 1, 0], [1, 0, 0], [0, 1, 0]],
    [[0, 1, 0], [0, 0, 1], [0, 1, 0], [0, 0, 1], [0, 1, 0]],
    [[0, 0, 0], [1, 0, 1], [0, 1, 0], [0, 0, 1], [0, 0, 0]],
    [[0, 1, 0], [1, 0, 0], [0, 1, 0], [0, 0, 1], [0, 1, 0]],
    [[0, 1, 0], [1, 0, 0], [0, 1, 0], [1, 0, 1], [0, 1, 0]],
    [[0, 1, 0], [0, 0, 1], [0, 0, 0], [0, 0, 1], [0, 0, 1]],
    [[0, 1, 0], [1, 0, 1], [0, 1, 0], [1, 0, 1], [0, 1, 0]],
    [[0, 1, 0], [1, 0, 1], [0, 1, 0], [0, 0, 1], [0, 1, 0]],
]

for a in range(5):
    # 가로선 줄
    if a % 2 == 0:
        for i in range(len(n)):
            # 시작은 공백
            print(" ", end="")

            # 1이면 가로선
            for _ in range(s):
                if arr[n[i]][a][1] == 1:
                    print("-", end="")
                else:
                    print(" ", end="")

            # 끝도 공백
            print(" ", end="")

            # 마지막 숫자면 엔터 아니면 공백
            if i == len(n) - 1:
                print()
            else:
                print(" ", end="")
    # 세로선 줄
    else:
        for i in range(s):
            for num in n:
                # 시작은 | 아니면 공백
                if arr[num][a][0] == 1:
                    print("|", end="")
                else:
                    print(" ", end="")

                # 가운데는 무조건 공백
                for j in range(s):
                    print(" ", end="")

                # 마지막은 | 아니면 공백
                if arr[num][a][2] == 1:
                    print("|", end="")
                else:
                    print(" ", end="")

                # 숫자 끝마다 공백
                print(" ", end="")

            # 마지막 숫자 뒤에는 엔터
            print()
